In [1]:
# importing the libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# importing the dataset onto the python environment

In [4]:
data = pd.read_csv(r"C:\Users\sebin\Downloads\StudentsPerformance.csv")

In [5]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [6]:
data.shape

(1000, 8)

In [7]:
data.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

# Q1) how many males and females participated in the test?

In [9]:
data.value_counts('gender')

gender
female    518
male      482
dtype: int64

# Q2) thoughts about students parental level of education.?

In [10]:
data['parental level of education'].nunique()

6

In [11]:
data.value_counts('parental level of education')

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
dtype: int64

From the dataset it is clear that there are less no of students whose parents have a bachelor's degree or master's degree

# 3) Who scores the most on average for math, reading and writing based on
a) Gender
b) Test preparation course

In [12]:
# a) Gender

avg_gender = data.groupby('gender').mean()
avg_gender

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

We can conclude that males scored more than females in math and females score more than males in reading and writing.

In [13]:
# b) Test preparation course

avg_tpc = data.groupby('test preparation course').mean()
avg_tpc

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

We can conclude that those students who completed the test preparation course scored more than those who havent.

# 4. What do you think about the scoring variation for math, reading and writing based on
● Gender
● Test preparation course

In [14]:
# Gender

var = data.groupby('gender').var()
var

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

Math score show the most variation between male and female followed by writing score whereas reading score showed the least variation.

In [15]:
# Test preparation course

tpc = data.groupby('test preparation course').var()
tpc

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

Those who completed the test preparation course shows less variation than those who have not completed any preparation course for math,reading and writing.

# 5. The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.

In [16]:
data1=data.sort_values('math score',ascending=False).head(250)
data1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64

In [17]:
data1.describe()

       math score  reading score  writing score
count  250.000000     250.000000     250.000000
mean    85.052000      84.256000      83.300000
std      6.270452       8.905487       9.594698
min     77.000000      60.000000      61.000000
25%     80.000000      78.000000      76.000000
50%     84.000000      84.000000      83.000000
75%     89.000000      90.000000      91.000000
max    100.000000     100.000000     100.000000

The above table show the top 250 students (25% of 1000) who are eligible for bonus points.It can also be given to students who scored 77 marks or more.